cases/seededFracture/Pe100Ra852/0/Y
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [1 -3 0 0 0 0 0];

internalField   uniform 317.6;

boundaryField
{
    up
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }

	    inlet
    {
        type            fixedValue;
        value           uniform 285.6;
    }
}


// ************************************************************************* //
