cases/seededFracture/Pe100Ra852/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * *                 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Df              Df    [0 2 -1 0 0 0 0] 1.61E-09;

beta0           beta0 [-1 3 0 0 0 0 0] 3.125E-04;// beta0 = beta/C_sat;

rho0            rho0  [1 -3 0 0 0 0 0] 1178;

nu              nu    [0 2 -1 0 0 0 0] 0.00000193;





// ************************************************************************* //
