cases/seededFracture/Pe100Ra852/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue eps 0.001
);

regions
(
    zoneToCell
    {
        name v0inlet;
        fieldValues
        (
            volScalarFieldValue eps 1
        );
    }
	    zoneToCell
    {
        name v0outlet;
        fieldValues
        (
            volScalarFieldValue eps 1
        );
    }
);


// ************************************************************************* //
